tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

vscode "cschlosser.doxdocgen"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "IBM.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "madhavd1.javadoc-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.Theme-PredawnKit"
vscode "redhat.java"
vscode "shengchen.vscode-checkstyle"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
