tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "openldap"
brew "curl"
brew "dust"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "hyperfine"
brew "mas"
brew "python@3.11", link: false
brew "ripgrep"
brew "stow"
brew "tree"
cask "cheatsheet"
cask "font-iosevka"
cask "iterm2"
mas "Core Shell", id: 1354319581
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
vscode "Codium.codium"
vscode "cschlosser.doxdocgen"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "IBM.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "madhavd1.javadoc-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.Theme-PredawnKit"
vscode "patbenatar.advanced-new-file"
vscode "redhat.java"
vscode "shengchen.vscode-checkstyle"
vscode "sleistner.vscode-fileutils"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
